---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditEditingElements
source: html/2aa0de21-f2c9-0be1-5283-a6316d0a5464.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditEditingElements Property

Can't obtain permission to edit the element: The Central Model is inaccessible and another user is editing the element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotEditEditingElements { get; }
```